Revit 2027 API
PointLocationOnCurve.MeasureFrom Property
 The location on the curve from which the measurement is taken.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointOnCurveMeasureFrom MeasureFrom { get; set; }
Public Property MeasureFrom As PointOnCurveMeasureFrom
	Get
	Set
public:
property PointOnCurveMeasureFrom MeasureFrom {
	PointOnCurveMeasureFrom get ();
	void set (PointOnCurveMeasureFrom value);
}
member MeasureFrom : PointOnCurveMeasureFrom with get, set
Property Value
PointOnCurveMeasureFrom
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The measure-from is not checked until this class is assigned for a particular reference point on a particular curve. At that time, the measure-from must be valid for the curve.
See Also
Reference
PointLocationOnCurve Class
Autodesk.Revit.DB Namespace